//=============================================================================
//
// ランキング処理 [rankingall.h]
// Author : Tanaka Rikiya
//
//=============================================================================
#ifndef _RANKINGALL_H_
#define _RANKINGALL_H_
#define _CRT_SECURE_NO_WARNINGS
//=============================================================================
//インクルード
//=============================================================================
#include "main.h"
#include "Scene.h"

#define RANKING_DATE (5)									// ランキング数

//=============================================================================
//前方宣言
//=============================================================================
class CRanking;

//=============================================================================
//ランキングモードのクラス
//=============================================================================
class CRankingAll
{
public:

	CRankingAll();
	~CRankingAll();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	// ランキング計算関数
	static CRankingAll * Create();

private:
	int FadeCount;
	static CRanking *pRanking;
};
#endif

